var data = [
        ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',''],
        ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',''],
        ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',''],
        ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],
        ['', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', ''],

    ];
    var container = document.getElementById('hot');
    var hot = new Handsontable(container, {
        licenseKey: 'non-commercial-and-evaluation',
        data: data,
        comments: true,
        autoWrapRow: true,
        autoWrapCol: true,
        contextMenu: true,
        formulas: true,
        columnSorting: true,
        filters: true,
        rowHeaders: true,
        colHeaders: true,
        stretchH: 'all',
        className: 'htCenter htMiddle',
        width: '100%',
        height: 'auto',
        manualColumnResize: true,
        manualRowResize: true

    });

    // Функция для экспорта данных в Excel
    function exportToExcel() {
        var wb = XLSX.utils.book_new();
        var ws = XLSX.utils.aoa_to_sheet(hot.getData());
        XLSX.utils.book_append_sheet(wb, ws, 'Sheet1');
        XLSX.writeFile(wb, 'excel_data.xlsx');
    }

    document.getElementById('export-btn').addEventListener('click', exportToExcel);
    // Функция для сохранения данных в localStorage
    function saveDataToLocalStorage() {
        localStorage.setItem('excelData', JSON.stringify(data));
    }

    // Функция для загрузки данных из localStorage
    function loadDataFromLocalStorage() {
        var savedData = localStorage.getItem('excelData');
        if (savedData) {
            data = JSON.parse(savedData);
            hot.loadData(data);
        }
    }

    // Вызываем функцию загрузки данных при загрузке страницы
    window.addEventListener('load', loadDataFromLocalStorage);

    // Обновляем данные в localStorage при изменении данных в таблице
    hot.addHook('afterChange', function() {
        saveDataToLocalStorage();
    });
